<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest free version of Cisco Webex for Apple silicon (ARM64) devices running macOS.</string>
    <key>Identifier</key>
    <string>com.github.Mac-Seven.download.CiscoWebex-arm64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Cisco Webex</string>
        <key>DOWNLOAD_URL</key>
        <string>https://binaries.webex.com/WebexDesktop-MACOS-Apple-Silicon-Gold/Webex.dmg</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
