<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
    <string>Download recipe for the latest free version of CCleaner.</string>
	<key>Identifier</key>
    <string>com.github.Mac-Seven.download.CCleaner</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CCleaner</string>
	</dict>
    <key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(CCMacSetup[\d]+.dmg)</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://www.ccleaner.com/ccleaner/download?mac</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://download.ccleaner.com/%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/CCleaner.app</string>
				<key>requirement</key>
				<string>identifier "com.piriform.ccleaner" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8M34BTQQ45"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
