<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest free version of CCleaner.</string>
    <key>Identifier</key>
    <string>com.github.Mac-Seven.download.CCleaner</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CCleaner</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.ccleaner.com/go/get_ccmac</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>


        <dict>
            <key>Processor</key>
            <string>PkgExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%/Install CCleaner*.pkg</string>
                <key>extract_root</key>
                <string>%RECIPE_CACHE_DIR%/BUILD_%NAME%</string>
            </dict>
        </dict>


    </array>
</dict>
</plist>
