<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Quickbooks ODBC Driver for Mac and turns it into a package.</string>
    <key>Identifier</key>
    <string>com.github.Mac-Seven.pkg.QuickbooksODBCDriver</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Quickbooks ODBC Driver</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.Mac-Seven.download.QuickbooksODBCDriver2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
                <key>extract_root</key>
                <string>%pkgroot%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>