<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Quickbooks ODBC Driver.</string>
	<key>Identifier</key>
    	<string>com.github.Mac-Seven.download.QuickbooksODBCDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Quickbooks ODBC Driver</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="(https:\/\/s3.amazonaws.com\/.+)">click here</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>http://shorturl.at/gmyO6</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
