<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Quickbooks ODBC Driver. 
		This requires the use of an external Python script as the CURLTextSearcher was unable to work with the ampersand in the original download URL.
		Instead a script downloads the html page and then it is referenced locally to get round this issue.</string>
	<key>Identifier</key>
    	<string>com.github.Mac-Seven.download.QuickbooksODBCDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Quickbooks ODBC Driver</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>getQuickbooksHTML</string>
        </dict>
    </array>
</dict>
</plist>
