<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Azure Data Studio.</string>
	<key>Identifier</key>
    <string>com.github.Mac-Seven.download.AzureDataStudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Azure Data Studio</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://docs.microsoft.com/en-us/sql/azure-data-studio/download-azure-data-studio?view=sql-server-ver15</string>
                <key>re_pattern</key>
                <string>linkid=(\d+)" data-linktype="external">Azure Data Studio for macOS</string>
            </dict>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>azuredatastudio.zip</string>
				<key>url</key>
				<string>%result_output_var_name%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
    </array>
</dict>
</plist>
