<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Azure Data Studio for Mac and turns it into a package.</string>
    <key>Identifier</key>
    <string>com.github.Mac-Seven.pkg.AzureDataStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Azure Data Studio</string>
        <key>APPNAME</key>
        <string>Azure Data Studio.app</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.Mac-Seven.download.AzureDataStudio</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>APPNAME</key>
                <string>Azure Data Studio.app</string>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%APPNAME%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications/%APPNAME%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>