<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Azure Data Studio for Mac and turns it into a package.</string>
    <key>Identifier</key>
    <string>com.github.Mac-Seven.pkg.AzureDataStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Azure Data Studio</string>
        <key>APPNAME</key>
        <string>Azure Data Studio.app</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.Mac-Seven.download.AzureDataStudio</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/BUILD_%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>APPNAME</key>
                <string>Azure Data Studio.app</string>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%APPNAME%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/BUILD_%NAME%/Applications/%APPNAME%</string>
            </dict>
        </dict>

        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>id</key>
                    <string>com.azuredatastudio.oss</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>


    </array>
</dict>
</plist>