<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Azure Data Studio.</string>
	<key>Identifier</key>
    <string>com.github.Mac-Seven.download.AzureDataStudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Azure Data Studio</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>linkid=([0-9\.]+)" rel="nofollow">macOS ZIP</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://github.com/microsoft/azuredatastudio/releases/latest</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
				<key>url</key>
				<string>https://go.microsoft.com/fwlink/?linkid=%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
    </array>
</dict>
</plist>
