<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>This recipe downloadsthe latest version of DisplayLink Manager for macOS.</string>
    <key>Identifier</key>
    <string>com.github.Mac-Seven.download.DisplayLink Manager</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Spline</string>
        <key>SEARCH_URL</key>
        <string>https://www.synaptics.com/node/4366?filetype=exe</string>
        <key>SEARCH_PATTERN</key>
        <string>https://www.synaptics.com/sites/default/files/exe_files/[\S]+\/[\S]+\-EXE.pkg</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>