<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads VueScan and then creates an installer package with the app and the needed authorization file.
This recipe requires the hansen-m-recipes (Matt Hansen) repo.

The recipe requires the authorization file created by VueScan for your licence.
The suggested way to do this is to install VueScan on the Mac/VM running AutoPkg and use the recipe's
default value for RC_FILE. Alternately, you can create a text file made up of the following four lines
(where you replace # with the values for your license):

[VueScan]
SerialNumber=#
CustomerNumber=#
EmailAddress=#@#.#

Then, save that file in a locally-accessible location and set the RC_FILE input variable to
the path to that file (including the file name with extension). AutoPkg will do the rest.</string>
	<key>Identifier</key>
	<string>com.github.jazzace.pkg.VueScanLicenced</string>
	<key>Input</key>
	<dict>
		<key>PKG_ID</key>
		<string>com.yourorg.vuescanlicenced.pkg</string>
		<key>RC_FILE</key>
		<string>/Users/Shared/.vuescanrc</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.VueScan</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Users</key>
					<string>0755</string>
					<key>Users/Shared</key>
					<string>1777</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/VueScan.app</string>
				<key>source_path</key>
				<string>%pathname%/*.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Users/Shared/.vuescanrc</string>
				<key>source_path</key>
				<string>%RC_FILE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Users</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Users/Shared</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
                    <key>PKG_ID</key>
                    <string>com.design.spline.pkg</string>
                    <key>id</key>
					<string>%PKG_ID%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
