<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of FileZilla.</string>
	<key>Identifier</key>
    	<string>com.github.Mac-Seven.download.FileZilla</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FileZilla</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://filezilla-project.org/download.php?show_all=1</string>
				<key>re_pattern</key>
				<string>https://[a-z0-9]+.cdn.filezilla-project.org/client/FileZilla_[0-9.]+_macosx-x86.[a-z0-9.?=A-Z_\&]+</string>
				<key>result_output_var_name</key>
				<string>url</string>				
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
