<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest avaialble version of FileZilla for macOS.</string>
    <key>Identifier</key>
    <string>com.github.Mac-Seven.download.FileZilla</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileZilla</string>
        <key>DOWNLOAD_URL</key>
        <string>https://dl3.cdn.filezilla-project.org/client/FileZilla_3.58.0_macosx-x86.tar.bz2?h=DyGY4Wrg-CZVDbTZKOr_Lg&x=1648817637</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%NAME%.app</string>
                <key>strict_verification</key>
                <false/>
                <key>requirement</key>
                <string>(identifier "org.filezilla-project.filezilla" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5VPGKXL75N")</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
