<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest unlicensed version of HighSide.</string>
    <key>Identifier</key>
    <string>com.github.Mac-Seven.download.HighSide</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>HighSide</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
              <key>url</key>
              <string>https://highside.io/download/</string>
              <key>result_output_var_name</key>
              <string>url_to_download</string>
              <key>re_pattern</key>
              <string>value="(https://highside\.io/download/.*dmg*)"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLRedirect</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url_to_download%</string>
                <key>redirect_url</key>
                <string>final_url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%redirect_url%</string>
                <key>filename</key>
                <string>HighSide.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
