<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest unlicensed version of HighSide.</string>
    <key>Identifier</key>
    <string>com.github.Mac-Seven.download.HighSide</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>HighSide</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>url</key>
            <string>https://highside.io/download/HighSide%20Setup.dmg</string>
        </dict>
    </array>
</dict>
</plist>
