<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest unlicensed version of HighSide.</string>
    <key>Identifier</key>
    <string>com.github.Mac-Seven.download.HighSide</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>HighSide</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
              <key>url</key>
              <string>https://highside.io/download/</string>
              <key>result_output_var_name</key>
              <string>url_to_download</string>
              <key>re_pattern</key>
              <string>href="(https://highside.io/download/.*dmg*)"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/HighSide.app</string>
                <key>requirement</key>
                <string>identifier "com.highside.client" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "AT8JR87667"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
