<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Authy Desktop full installer disk image</string>
    <key>Identifier</key>
    <string>com.github.psmac.download.authy</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Authy Desktop</string>
    </dict>
    <key>Process</key>
    <array>
	   <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
              <key>url</key>
              <string>https://authy.com/download/</string>
              <key>result_output_var_name</key>
              <string>url_to_download</string>
              <key>re_pattern</key>
              <string>value="(https://electron.*platform=darwin.*)"&gt;macOS</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLRedirect</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url_to_download%</string>
                <key>redirect_url</key>
                <string>final_url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%redirect_url%</string>
                <key>filename</key>
                <string>AuthyDesktop.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
