<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Authy Desktop full installer disk image and packages</string>
    <key>Identifier</key>
    <string>com.github.psmac.pkg.authy</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Authy Desktop</string>
		<key>Sync_Path</key>
		<string>/Users/Shared/Sync/_Master</string>
    </dict>
    <key>Process</key>
    <array>
	   <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
              <key>url</key>
              <string>https://authy.com/download/</string>
              <key>result_output_var_name</key>
              <string>url_to_download</string>
              <key>re_pattern</key>
              <string>value="(https://electron.*platform=darwin.*)"&gt;macOS</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLRedirect</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url_to_download%</string>
                <key>redirect_url</key>
                <string>final_url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%redirect_url%</string>
                <key>filename</key>
                <string>AuthyDesktop.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Authy Desktop.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Authy Desktop.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/Authy Desktop.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>com.authy.installer</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%Sync_Path%/%NAME%-%version%.pkg</string>
				<key>overwrite</key>
				<false/>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
